In [1]:
import pandas as pd 

dados = pd.read_csv('Arquivo Aluguel.csv', sep=';')

#### Explorando dados

In [2]:
type(dados)

pandas.core.frame.DataFrame

In [3]:
dados.head(2)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN

In [4]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

In [5]:
#Verificando valores nulos
dados.isna().any()

Tipo          False
Bairro        False
Quartos       False
Vagas         False
Suites        False
Area          False
Valor          True
Condominio     True
IPTU           True
dtype: bool

In [6]:
# Cria um dataframe somente com os tipos de dados
tipo_de_dados = pd.DataFrame(dados.dtypes,columns=['Tipos de dados'])
tipo_de_dados.columns.name = 'Variaveis'
tipo_de_dados

Variaveis  Tipos de dados
Tipo               object
Bairro             object
Quartos             int64
Vagas               int64
Suites              int64
Area                int64
Valor             float64
Condominio        float64
IPTU              float64

In [7]:
print (f'A base tem {dados.shape[0]} registros(imóveis) e {dados.shape[1]} variáveis')

A base tem 32960 registros(imóveis) e 9 variáveis

In [8]:
# Criando variavel com o tipo de imoveis
tipo_de_imoveis = dados['Tipo']
tipo_de_imoveis

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
                  ...
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

In [9]:
# Removendo as duplicidades para ver quais são os tipos dos imoveis
tipo_de_imoveis.drop_duplicates(inplace=True)
tipo_de_imoveis

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

In [10]:
# Transformando variavel (series) em DataFrame 
tipo_de_imoveis = pd.DataFrame(tipo_de_imoveis)
tipo_de_imoveis

                              Tipo
0                        Quitinete
1                             Casa
2          Conjunto Comercial/Sala
3                      Apartamento
7               Casa de Condomínio
16                  Prédio Inteiro
17                            Flat
29                      Loja/Salão
80         Galpão/Depósito/Armazém
83                  Casa Comercial
117                   Casa de Vila
159                 Terreno Padrão
207                    Box/Garagem
347                           Loft
589    Loja Shopping/ Ct Comercial
2157                       Chácara
3354         Loteamento/Condomínio
4379                         Sítio
4721                 Pousada/Chalé
6983                        Studio
9687                         Hotel
23614                    Indústria

In [11]:
tipo_de_imoveis.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22 entries, 0 to 23614
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Tipo    22 non-null     object
dtypes: object(1)
memory usage: 352.0+ bytes

In [12]:
# Verificando indices
tipo_de_imoveis.index

Int64Index([    0,     1,     2,     3,     7,    16,    17,    29,    80,
               83,   117,   159,   207,   347,   589,  2157,  3354,  4379,
             4721,  6983,  9687, 23614],
           dtype='int64')

In [13]:
# Verificando quantidade de linhas 
tipo_de_imoveis.shape[0]
range(tipo_de_imoveis.shape[0])

range(0, 22)

In [14]:
# Atribuindo o novo indice ao dataframe
tipo_de_imoveis.index = range(tipo_de_imoveis.shape[0])

In [15]:
# Alterando nome coluna indice 
tipo_de_imoveis.columns.name = 'Id'
tipo_de_imoveis

Id                         Tipo
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

In [16]:
list(dados['Tipo'].drop_duplicates())

['Quitinete',
 'Casa',
 'Conjunto Comercial/Sala',
 'Apartamento',
 'Casa de Condomínio',
 'Prédio Inteiro',
 'Flat',
 'Loja/Salão',
 'Galpão/Depósito/Armazém',
 'Casa Comercial',
 'Casa de Vila',
 'Terreno Padrão',
 'Box/Garagem',
 'Loft',
 'Loja Shopping/ Ct Comercial',
 'Chácara',
 'Loteamento/Condomínio',
 'Sítio',
 'Pousada/Chalé',
 'Studio',
 'Hotel',
 'Indústria']

In [17]:
# criando uma lista com determinados tipos
residencial = ['Quitinete', 'Casa', 'Conjunto Comercial/Sala', 'Apartamento', 'Casa de Condomínio']
residencial

['Quitinete',
 'Casa',
 'Conjunto Comercial/Sala',
 'Apartamento',
 'Casa de Condomínio']

In [18]:
# Filtrando a coluna tipo de acordo com a lista criada na variavel residencial 
selecao = dados['Tipo'].isin(residencial)
selecao

0        True
1        True
2        True
3        True
4        True
         ...
32955    True
32956    True
32957    True
32958    True
32959    True
Name: Tipo, Length: 32960, dtype: bool

In [19]:
# Cria um dataframe com base nos tipos adicionados a variavel(list) 'residencial'
dados_residencial = dados[selecao]
dados_residencial

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
...,...,...,...,...,...,...,...,...,...
32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN
32959,Conjunto Comercial/Sala,Centro,0,0,0,250,6500.0,4206.0,1109.0

In [20]:
# Ajustando coluna indice numeros sequenciais 
dados_residencial.index = range(dados_residencial.shape[0])

In [21]:
dados_residencial.shape

(29146, 9)

#### Perguntas:

In [22]:
# Qual a quantidade de imoveis com o tipo 'Apartamento'
selecao = dados['Tipo'] == 'Apartamento'
n1 = dados[selecao]
n1.shape[0]

19532

In [23]:
# Qual a quantidade de imoveis classificados como casa, casa de condomínio e cada de vila 
selecao2 = (dados['Tipo'] == 'Casa') |(dados['Tipo'] == 'Casa de Condomínio') |(dados['Tipo'] == 'Casa de Vila')
n2 = dados[selecao2].shape[0]
n2

2212

In [24]:
# Quantidade de imoveis entre 60 a 100m²
selecao3 = (dados['Area'] >=60) & (dados['Area']<=100)
n3 = dados[selecao3].shape[0]
n3

10187

In [25]:
# Quantidade de imoveis com menos de 4 quartos e aluguel menor que 2 mil

selecao4 = (dados['Quartos'] <4) & (dados['Valor'] <=2000)
n4 = dados[selecao4].shape[0]
n4

12758

In [26]:
#Verificando valores nulos
dados.isna().any()

Tipo          False
Bairro        False
Quartos       False
Vagas         False
Suites        False
Area          False
Valor          True
Condominio     True
IPTU           True
dtype: bool

In [27]:
# Quantidade de valores nulos na coluna Valor (Após primeira primeira execução os valores se tornam 0)
dados[dados['Valor'].isnull()].shape[0]

17

In [28]:
# Removendo nulos na coluna "Valor"
dados.dropna(subset=['Valor'],inplace=True)
dados[dados['Valor'].isnull()].shape[0]

0

In [29]:
# Quantidade de valores nulos na coluna Codomínio 
dados[dados['Condominio'].isnull()].shape[0]

4089

In [30]:
# Quantidade de valores nulos na coluna Codomínio 
dados[dados['IPTU'].isnull()].shape[0]

10227

In [31]:
# Para não perder muitos dados vamos substituir os valores nulos com 'zero'
dados = dados.fillna({'Condominio' : 0, 'IPTU' : 0})

In [33]:
dados.isna().any()

Tipo          False
Bairro        False
Quartos       False
Vagas         False
Suites        False
Area          False
Valor         False
Condominio    False
IPTU          False
dtype: bool

In [41]:
# Adicionando coluna valor bruto da despesa 
dados['Valor Bruto'] = dados['Valor'] + dados['Condominio'] + dados['IPTU'] 
dados['Valor Bruto'] = dados['Valor Bruto'].round(2)
dados.head(3)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,56.500000
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.000000
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0,10331.0,68.873333

In [47]:
# Adicionando coluna com valor por M² 
dados['Valor m2'] = dados['Valor Bruto'] / dados['Area']
dados['Valor m2'] = dados['Valor m2'].head(2)
dados.head(3)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,56.5
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.0
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0,10331.0,NaN

In [48]:
# Classificando imovel se casa ou não 
casa = ['Casa', 'Casa de Condomínio', 'Casa de Vila']

In [49]:
dados['Tipo agregado'] = dados['Tipo'].apply(lambda x:'Casa' if x in casa else 'Apartamento')

In [56]:
dados.head(2)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Tipo agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,56.5,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.0,Casa

In [ ]:
#